app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets"  ORDER BY "markets"."name" DESC
---
  def index #VIEWED BY USER
    @markets = Market.order(name: :asc)

SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT 1  [["id", 54]]
---
  def show
    @market = Market.find(params[:id])