app/controllers/markets_controller.rb

  def index #VIEWED BY USER
    @markets = Market.all
---
SELECT "markets".* FROM "markets"